---
kind: property
id: P:Autodesk.Revit.UI.Events.ViewActivatingEventArgs.NewActiveView
source: html/f5fabd16-b529-1ba4-1911-2ab0f9b3b2c2.htm
---
# Autodesk.Revit.UI.Events.ViewActivatingEventArgs.NewActiveView Property

The view that is going to become active.

## Syntax (C#)
```csharp
public View NewActiveView { get; }
```